{
  "list": [
    {
      "name": "auto-armor",
      "header": "Авто Доспехи",
      "description": [
        "Плагин «Авто Доспехи» автоматически экипирует боту лучшую доступную броню из инвентаря. Он поддерживает все типы доспехов: шлемы, нагрудники, поножи и ботинки.",
        "Система оценки брони основана на внутреннем приоритете материалов: кожаная < золотая < кольчужная < медная < железная < алмазная < незеритовая. Бот всегда выберет самый защищённый вариант, если он лучше текущего.",
        "Если слот для нужной части брони уже занят, плагин временно переместит старую броню в свободное место инвентаря, чтобы надеть новую. При отсутствии свободного места экипировка не произойдёт."
      ],
      "latest-update": "10.02.2026"
    },
    {
      "name": "auto-totem",
      "header": "Авто Тотем",
      "description": [
        "Плагин «Авто Тотем» следит за тем, чтобы в off-hand всегда находился тотем бессмертия. Если слот пуст, а в инвентаре есть хотя бы один тотем — он будет немедленно перемещён туда.",
        "Это особенно полезно в боевых или опасных ситуациях, когда бот может умереть, но должен выжить благодаря автоматическому использованию тотема."
      ],
      "latest-update": "10.02.2026"
    },
    {
      "name": "auto-eat",
      "header": "Авто Еда",
      "description": [
        "Плагин «Авто Еда» позволяет боту автоматически есть пищу, когда уровень голода падает ниже 20 (максимум). Он не просто ест первую попавшуюся еду — он выбирает оптимальную по приоритету.",
        "Пища разделена на 4 категории: от 0 (низкая питательность, например, ягоды) до 3 (высокая, например, золотое яблоко или золотая морковь). Чем ниже здоровье или сытость бота, тем выше приоритет требуемой еды.",
        "Перед едой плагин перемещает выбранную еду в горячую панель (если её там нет), используя свободный слот или временно заменяя случайный предмет. Во время еды блокируется использование зелий, чтобы избежать конфликтов.",
        "Если здоровье бота менее 12 сердец, он начнёт есть золотые или зачарованные золотые яблоки, если те есть в инвентаре, чтобы восстановить здоровье."
      ],
      "latest-update": "10.02.2026"
    },
    {
      "name": "auto-potion",
      "header": "Авто Зелье",
      "description": [
        "Плагин «Авто Зелье» автоматически даёт боту выпить или бросить зелье в зависимости от ситуации. Он активируется, когда здоровье бота падает ниже 20 сердец, но выбор зелья зависит от контекста."
      ],
      "latest-update": "10.02.2026"
    },
    {
      "name": "auto-shield",
      "header": "Авто Щит",
      "description": [
        "Плагин «Авто Щит» обеспечивает автоматическую защиту бота в бою: если рядом находится враждебный игрок или монстр, а в инвентаре есть щит, он будет немедленно перемещён в off-hand и активирован.",
        "Плагин проверяет наличие щита в инвентаре и, при необходимости, переносит его в слот 45. После этого бот поворачивается к ближайшей угрозе и активирует блокирование на короткое время, имитируя естественное поведение игрока.",
        "Активация щита происходит только тогда, когда бот не ест и не пьёт, и при этом разрешены действия взаимодействия и поворота головы. Это предотвращает конфликты с другими плагинами и сохраняет реалистичность поведения."
      ],
      "latest-update": "10.02.2026"
    },
    {
      "name": "auto-repair",
      "header": "Авто Починка",
      "description": [
        "Плагин «Авто Починка» автоматически восстанавливает изношенные предметы с зачарованием «Ремонт» (Mending), используя бутылки опыта. Он следит за состоянием всех предметов в инвентаре и начинает починку, как только износ превышает 50%.",
        "Для починки плагин берёт бутылку опыта из инвентаря, помещает повреждённый предмет в off-hand (или использует горячую панель, если предмет там), поднимает взгляд вверх и активирует использование предмета — стандартный способ применения Mending в Minecraft.",
        "Плагин корректно работает с любыми предметами, имеющими прочность и зачарование Mending: мечами, луками, доспехами и инструментами. Он также учитывает текущие состояния бота — например, не начнёт починку во время еды или питья."
      ],
      "latest-update": "10.02.2026"
    },
    {
      "name": "auto-look",
      "header": "Авто Взгляд",
      "description": [
        "Плагин «Авто Взгляд» имитирует естественное поведение игрока, периодически направляя взгляд бота на ближайшие сущности — будь то другие игроки, животные или монстры — в радиусе до 14 блоков.",
        "Как только бот достигает цели передвижения, он начинает плавно поворачивать голову к ближайшей сущности, добавляя небольшой случайный дрожащий эффект для большей реалистичности. Это делает поведение бота менее механическим и более органичным.",
        "Плагин активен только тогда, когда разрешено управление взглядом, и не мешает другим действиям, таким как бой, еда или использование предметов. Он идеально дополняет другие плагины, создавая цельную и правдоподобную игровую логику."
      ],
      "latest-update": "10.02.2026"
    }
  ]
}